app/views/pages/home.html.erb

                        <div class="col-sm-6" style="font-size: 80%; opacity: 0.7;">POSTS<br/>
                            <h6 style="color:#008484; font-size: 200%;"><%= current_user.posts.count %></h6>
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC