app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id #assign the post
        respond_to do |f|
            if(@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Form test"], ["user_id", 3], ["created_at", "2017-07-03 11:59:10.789782"], ["updated_at", "2017-07-03 11:59:10.789782"]]